Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: དེ་དག་ བྲམ་ཟེ་ རྟོག་གེ་པ་ བསྟན་བཅོས་ ངན་པ ས་ བསླུས་པ་ རྣམས་ ཀྱིས་ ཚོར་ ནས་ འདི་ལྟར་ ལོ་ལེགས་ པར་ འགྱུར་ རོ །_།
en: $104 “When brahmin scholars who are deceived by unwholesome treatises notice this, they will declare, ‘Harvests will be good!’

source: མཚོན་ གྱིས་ འཁྲུག་པ ར་ འགྱུར་ རོ །_།
en: ‘There will be war!’

source: མཚོན་ གྱིས་ འཁྲུག་པ་ མེད་པར་ འགྱུར་ རོ །_།
en: ‘There will be peace!’

source: ཆར་ ལེགས་པ ར་ འབབ་པ ར་ འགྱུར་ རོ །_།
en: ‘Good rain will fall!’

source: ཆར་ ལེགས་པ ར་ འབབས་ པར་ མི་ འགྱུར་ རོ །_།
en: ‘No rain will fall!’

source: བ་ལང་ དང་ བྲམ་ཟེ་ འཕེལ་བ ར་ འགྱུར་ རོ །_།
en: ‘Cows and brahmins will flourish!’

source: བ་ལང་ དང་ བྲམ་ཟེ་ འགྲིབ་པ ར་ འགྱུར་ རོ་
en: ‘Cows and brahmins will decline!’

source: ཞེས་ དེ་ལྟ ར་ མི་ རྟོག་གེ་པ་ དག་ མངོན་པར་ རྗོད་པ ར་ བྱེད་ དེ་དེ་ ལྟར་ ས་གཡོ་ བར་ འགྱུར་ རོ །_།
en: The sophists will make such pronouncements when the earth shakes.

source: ཡང་ རྒྱུ་ གཞན་ གྱིས་ ས་གཡོ་ བར་ བྱེད་པ་ ལ་ དེ་ལྟ ར་ དགེ་སློང་ དེ་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $105 “Next, the monk will examine other causes of earthquakes by means of knowledge derived from hearing.

source: སེམས་ཅན་ རྣམས་ ཀྱི་ དགེ་བ་ དང་ མི་དགེ་བ འི་ དབང་ གིས་ རླུང་ ས་འཛིན་ ཞེས་ བྱ་བ་ གཡོ་ བར་ བྱེད་ དོ །_།
en: Thus, he will notice how the so-called gripping wind rises due to the virtue and nonvirtue of sentient beings.

source: དེ་ གཡོས་པ ས་ ཆུ་ གཡོ་ བར་ བྱེད་ དེ །_ ཆུ་ གཡོས་པ ས་ ཀྱང་ ས་གཡོ་ བར་ བྱེད་ དེ །_
en: When that wind stirs, the waters will stir as well, and when the waters churn, the earth will also do so.

source: དཔག་ཚད་ ལྔ་ བརྒྱ འམ །_ དཔག་ཚད་ བརྒྱ འམ །_ དཔག་ཚད་ ཉིས་ བརྒྱ འམ །_ དཔག་ཚད་ སུམ་བརྒྱ འམ །_ དཔག་ཚད་ བཞི་ བརྒྱ འམ །_ དེ་ལྟ ར་ ཚད་ ཇི་ཙམ་ དུ་ རླུང་ གཡོ་ བར་ བྱེད་པ འི་ ཚད་ དེ་ཙམ་ དུ་ ཆུ་ གཡོ་ བར་ བྱེད་ ལ །_ ཆུ་ གཡོ་བ འི་ ཚད་ ཀྱིས་ ས་གཡོ་ བར་ བྱེད་ དོ །_།
en: The wind thus may blow across one hundred, two hundred, three hundred, four hundred, or five hundred leagues, or some other distance, and as far as the wind blows, the waters will be stirred as well. And when the waters churn, the earth will quake.

source: དེ་ ལ་ གང་ རླུང་ དག་ གཡོ་བ་ ན་ ཆུ་ གཡོ་ བར་ བྱེད །_ [16a] ཆུ་ གཡོས་པ ས་ ས་གཡོ་ བར་ བྱེད་པ འི་ རྒྱུ་ ནི་ གང་ རྐྱེན་ ནི་ གང་ གཞི་ ནི་ གང་ཡིན་ སྙམ་ ནས །_
en: $106 “Noticing this, the monk will wonder, ‘What are the causes and conditions that rouse the wind, thereby stirring the waters, [16.a] so that the earth trembles?’

source: དགེ་སློང་ དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ འམ །_ ལྷ འི་ མིག་ གིས་ བརྟགས་ ན །_
en: When the monk has examined this matter by means of knowledge derived from hearing or through the divine eye, he will think,

source: རླུང་ གིས་ ཆུ་འཛིན་ ལ །_ ཆུ་ ལ་ ས་ བརྟེན་ ཏེ །_
en: ‘The wind seizes the waters and the waters support the earth.

source: རླུང་ དེ་དག་ གཡོས་ ན་ ཆུ་ གཡོ་ བར་ འགྱུར །_ དེ་དག་ གཡོས་པ ས་ ས་གཡོ་ བར་ འགྱུར་ རོ་ སྙམ་ ནས་ དེ་ལྟ ར་ རྒྱུ་ དེས་ན་ ས་གཡོ་ བར་ འགྱུར་ རོ །_།
en: Hence, when the wind is stirred, the waters will be stirred, and this will make the ground shake.’

source: ས་གཡོ་བ་ དེ་ཡང་ དགེ་སློང་ དེས་ རྣམ་པ་ གཉིས་ སུ་ མཐོང་ སྟེ །_
en: $107 “In this regard, the monk may observe two types of earth tremors.

source: གལ་ཏེ་ དགེ་བ འི་ ལས་ ཀྱི་ དབང་ གིས་ གཡོ་ ན་ ནི་ དེ་ དགེ་བ ར་ འགྱུར་ ཏེ །_
en: If the ground shakes due to virtuous karmic action, this is auspicious.

source: སེམས་ཅན་ རྣམས་ ཀྱི་ བདེ་བ་ དང་ ལོ་ལེགས་པ་ ཡིན་ ནོ །_།
en: Beings will be happy, and harvests will be good.

source: གལ་ཏེ་ མི་དགེ་བ འི་ དབང་ གིས་ གཡོ་ ན་ ནི་ལ ས་ ཀྱི་ མཐའ་ སྤྱད་ ཅིང་ གང་ བྱས་པ འི་ སེམས་ཅན་ རྣམས་ ཀྱི་ དེ་ མི་དགེ་བ ར་ འགྱུར་ རོ །_།
en: But if the ground shakes due to unvirtuous karmic action, the conduct and activity of sentient beings is inauspicious.

source: དགེ་བ་ དང་ མི་དགེ་བ་ ལ་ རག་ ལས་པ་ ཐམས་ཅད་ ནི་ རྒྱུ་ མེད་པ་ མ་ ཡིན །_ འདོད་རྒྱལ་ ལས་ བྱུང་བ་ མ་ ཡིན །_
en: Since earthquakes thus depend on virtue and nonvirtue, they are not uncaused or random, nor do they happen by the will of an agent.

source: བྱེད་པ་པོ ས་ གནས་ སུ་ བྱས་པ་ མ་ ཡིན་ ཏེ །_ རྒྱུ་ དང་ འཐུན་ པར་ འབྲས་བུ་འབྱུང་ ངོ་ །_།
en: Rather, they are effects that accord with their causes.

source: འབྲས་བུ་ མངོན་པར་ མི་ ཤེས་པ འི་ རྟོག་གེ་པ་ དག་ ན་རེ །_
en: $108 “However, scholars who are ignorant about effects will examine this and say,

source: འདི་ལྟར་ དབང་པོ འི་ ཕྱོགས་ དག་ས་ གཡོ འོ །_།
en: ‘This earthquake is due to the forces of the Lord!’

source: རླུང་ གི་ ཕྱོགས་ དག་ས་ གཡོ འོ །_།
en: ‘This earthquake is due to the forces of the wind!’

source: ཆུ་ལྷ འི་ ཕྱོགས་ དག་ས་ གཡོ་ སྟེ །_
en: ‘This earthquake is due to the forces of the water god!’

source: ཆར་ ལེགས་པ ར་ འབབ་པ ར་ མི་ འགྱུར་ རོ །_།
en: ‘No rain will fall!’

source: བ་ལང་ དང་ བྲམ་ཟེ་ འགྲིབ་པ ར་ འགྱུར་ རོ་ ཞེས་ དེ་ལྟ ར་ རྟོག་གེ་པ་ དག་ རྟོག་པ ར་ བྱེད་ དོ །_།
en: ‘Cows and brahmins will decline!’

source: དེ་ཡང་ གཅིག་ཅིག་ ཡིན་ ཏེ །_ གལ་ཏེ་ འདོད་རྒྱལ་བ་ བརྒྱ་ སྙེད་ ཡོད་པ་ དེ་དག་ གི་ ནང་ ན་ འདི་ལྟར་ འདུ་ཤེས་པ་ འདི་ཁོ་ན་ ཉིད་ གཅིག་ ཡིན་ ནོ་ ཞེས་ དེ་དག་ རྗོད་པ ར་ བྱེད་ དོ །_།
en: In this manner, they will proclaim whichever random idea they have arrived at to be the one, true account.#230

source: དེ་ནས་ གཞན་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ མི་ ལྡན་པ་ རབ་ འཇོམས་ ལ་སོགས་པ་ འཇིག་རྟེན་ ལ་ ཕན་པ ར་ མི་ བྱེད་པ་ ཤེས་ ནས
en: $109 “The monk who has knowledge of the effects of the ripening of karmic actions is at this point aware that the necklace asuras, the asura king Firm, and the unrighteous nāga kings, such as Pramatha, will do nothing good for the world.

source: གཉེན་པོ་ ཆོས་ དང་ ལྡན་ [16b] པ་ ལ་ རྗེས་སུ་ སེམས་པ ར་ བྱེད་ དེ །_
en: Contemplating the prospects of a just remedy, [16.b] the monk will think,

source: ཀྱེ་མ་ ཀླུ་ སྡང་བ་ དེ་དག་ དང་ ལྷ་མ་ ཡིན་ སྡིག་ཅན་ འཇིག་རྟེན་ ལ་ མི་ ཕན་པ ར་ བྱེད་པ་ དེ་དག་ ཇི་ལྟ ར་ ཕམ་པ ར་ འགྱུར་ སྙམ་ ནས་
en: ‘What might cause the fall of the aggressive nāgas and evil asuras, who do nothing good for the world?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན འདི་ལྟར་ གལ་ཏེ་ འཛམ་བུ འི་ གླིང་ དུ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ མི་དགེ་ སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ་ དང་ །_ རིགས་ ཀྱི་ རྒན་རབས་ ལ་ གུས་པ ར་ བྱེད་པ འི་ རྒྱལ་པོ་ དང་ བློན་པོ་ ཆེན་པོ་ འབྱུང་ ན
en: $110 “Investigating with knowledge derived from hearing, he will then notice that the terrestrial yakṣas gain power when people in Jambudvīpa are righteous and follow the Dharma, and when kings and ministers revere mendicants and brahmins and have respect for the previous generations of their families.

source: ས་བླ འི་ གནོད་སྦྱིན་ དེ་དག་ མཐུ་ ཆེ་བ ར་ འགྱུར་ ཏེ །_ དེ་དག་ གི་ ཀླུ་ དང་ །_ ལྷ་མ་ ཡིན་ སྡིག་ཅན་ ས འི་ འོག་ ན་ གནས་པ་ དེ་དག་ གཡོས་པ ར་ མཐོང་ ནས་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ ས་བླ འི་ གནོད་སྦྱིན་ དེ་དག་ གིས་ བར་སྣང་ ལ་ རྒྱུ་བ འི་ གནོད་སྦྱིན་ རྣམས་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ལ་ ཡང་ སྔ་མ་ བཞིན་ བསྙད་ དོ །_།
en: When the terrestrial yakṣas see that the evil nāgas and asuras that live underground are causing the ground to quake, these righteous yakṣas who follow the Dharma will inform the celestial yakṣas and the nāga kings Takṣaka, Vāsuki, and so on, just as before.

source: དེ་ནས་ ས་བླ འི་ གནོད་སྦྱིན་ དེ་དག་ ལས་ ཐོས་ ནས་ བར་སྣང་ ལ་ སྤྱོད་པ འི་ གནོད་སྦྱིན་ རྫུ་འཕྲུལ་ ཆེ་ ཞིང་ མཐུ་ ཆེ་བ ར་ འགྱུར་ ཏེ །_
en: When the celestial yakṣas receive the message from the terrestrial yakṣas, their miraculous powers and force will increase.

source: རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ ཀུན་ ཏུ་ རྒྱུ་བ་ རྣམས་ ལ་ སྦྲན་པ འི་ ཕྱིར་ ཁྲོ་བ འི་ ཤུགས་ ཀྱིས་ ཁ་ རླངས་ དག་པ ར་ སྣང་ ལ་ འབྱུང་ ཞིང་ འོང་ ལ །_
en: In order to summon the wandering gods of the Four Great Kings, they emit a wrathful, steamy breath that fills the atmosphere. With this, they send this message:

source: འདི་ལྟར་ ལྷ་ དག་ ཀླུ་ སྡང་བ་ རྣམས་ དང་ །_ ལྷ་མ་ ཡིན་ སྡིག་ཅན་ རྣམས་ མི་ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ རྣམས་ མ་ རུང་བ ར་ བྱ་བ འི་ ཕྱིར་ འཇུག་པ ར་ བྱེད་ དོ་ ཞེས་ བསྙད་ དོ །_།
en: ‘Gods, aggressive nāgas and evil asuras are preparing to harm those righteous humans who follow the Dharma!’

source: གནོད་སྦྱིན་ གྱི་ ཁ་ རླངས་ བྱུང་བ་ དེ་ རྟོག་གེ་པ་ བསྟན་བཅོས་ ངན་པ་ ལ་ སེམས་ རྣམ་པར་ རྨོངས་པ་ དག་ གིས་ མཐོང་ ནས །_
en: $111 “When sophists who are deluded by unwholesome treatises see the yakṣas’ steamy breath, they will think,

source: འདི་ལྟར་ གཤིན་རྗེ འི་ བུ་ བརྒྱ་རྩ་ གཅིག་ གི་ ནང་ ན་ གཤིན་རྗེ འི་ བུ་ དུ་བ་ མཇུག་ རིངས་ འབྱུང་ ངོ་ ཞེས་ བརྗོད་ དེ །_
en: ‘Now Ketu, who is one of the hundred sons of the Lord of Death, has arrived.’

source: གནོད་སྦྱིན་ མཐུ་ རབ་ཏུ་ ཆེན་པོ་ བརྒྱ་རྩ་ གཅིག་ གྱེན་ དུ་ འགྲོ་བ་ སྣང་བ་ དང་ མི་སྣང་བ་ གང་ཡིན་པ་ དེ་དག་ ལ་ རྟོག་གེ་པ་ དག་ ན་རེ་ འདི་ལྟར་ འདི་ ནི་ གཤིན་རྗེ འི་ བུ་ བརྒྱ་རྩ་ གཅིག་ གི་ ནང་ ན་ མཇུག་ རིངས་ འབྱུང་ ངོ་
en: Thus, when the one hundred and one very powerful yakṣas soar upward—both those that are visible and those that are not#231—the sophists will claim that this is Ketu, who is one of the hundred sons of the Lord of Death.

source: ཞེས་ གཞན་ དུ་ ཡོངས་སུ་ རྟོག་ ཅིང་ ལོ་ལེགས་ པར་ འགྱུར་ རོ །_།
en: They will then proclaim such things as ‘Harvests will be good!’

source: བ་ལང་ དང་ བྲམ་ཟེ་ [17a] འཕེལ་བ ར་ འགྱུར་ རོ །_།
en: ‘Cows and brahmins [17.a] will flourish!’

source: བ་ལང་ དང་ བྲམ་ཟེ་ འགྲིབ་པ ར་ འགྱུར་ རོ །_།
en: ‘Cows and brahmins will decline!’

source: ཡུལ་མི་ ཆེ་གེ་མོ་ ཞིག་ ལ་ གནོད་པ ར་ འགྱུར་ རོ །_།
en: ‘Such and such a place will suffer harm!’

source: ཡུལ་ གྱི་ མི་ ཆེ་གེ་མོ་ ཞིག་ ལ་ གནོད་པ ར་ མི་ འགྱུར་ རོ་ ཞེས་ དེ་དག་ ལ་ ལོག་པ ར་ རྟོག་པ ར་ བྱེད་པ་ མཐོང་ ངོ་ །_།
en: ‘Such and such a place will not suffer harm!’

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ །_ ཀླུ་ རྣམས་ དང་ །_ ལྷ་མ་ ཡིན་ སྡིག་ཅན་ གཡོས་པ་ རྣམས་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $112 “The monk who has knowledge of the effects of the ripening of karmic actions will continue to examine the tremors caused by evil nāgas and asuras.

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ འདི་ལྟར་ གནོད་སྦྱིན་ རྫུ་འཕྲུལ་ ཆེ་ ཞིང་ མཐུ་ ཆེ་བ་ རྣམས་ ལྷ་ ཀུན་ ཏུ་ རྒྱུ་བ་ རྣམས་ ལ་ སྒྲོགས་ པར་ བྱེད་པ་ སྔར་ བསྟན་པ་ ཇི་ལྟ་བ་ བཞིན་ མཐོང་ སྟེ །_
en: Hence, as he applies knowledge derived from hearing, he sees how those yakṣas with great miraculous powers inform the wandering gods in the way just explained.

source: ཀུན་ ཏུ་ རྒྱུ་བ་ རྒྱལ་ཆེན་ བཞི་པ་ དེ་ རྣམས་ ཀྱིས་ ཀྱང་ འདི་ལྟར་ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ནི་ འགྲིབ་བོ །_། བདག་ཅག་ གི་ ལྷ འི་ ཕྱོགས་ ཀྱི་ སྟོབས་ ནི་ རབ་ཏུ་ ཆེ འོ །_།
en: In response, the wandering gods of the Four Great Kings will proclaim, ‘The forces of the asuras are weak, but our own divine forces possess tremendous power.

source: འཛམ་བུ འི་ གླིང་ ན་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ མི་ མར་ འཛིན་པ་ དང་ །_ ཕ ར་ འཛིན་པ་ དང་ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ་ དང་ །_ སྡོམ་པ་ བླངས་པ་ དང་ །_ རིགས་ ཀྱི་ རྒན་རབས་ ལ་ གུས་པ ར་ བྱེད་པ་ དག་ ཡོད་པ ས་ ཀླུ་ སྡང་བ་ དང་ །_ ལྷ་མ་ ཡིན་ སྡིག་ཅན་ རྣམས་ ལས་ བདག་ཅག་ རྒྱལ་བ ར་ འགྱུར་ གྱིས་ མ་ འཇིགས་ ཤིག་ མ་ འཇིགས་ ཤིག་ ཅེས་ སྒྲོགས་ པར་ བྱེད་ དོ །_།
en: In Jambudvīpa there are righteous people who follow the Dharma, who respect their mothers and fathers, mendicants, brahmins, and vow holders, and who respect their ancestral families. For their sake we shall defeat the aggressive nāgas and evil asuras! Fear not, fear not!’

source: གནོད་སྦྱིན་ རྫུ་འཕྲུལ་ ཆེ་ ཞིང་ མཐུ་ ཆེ་བ་ དེ་དག་ ལྷ་ ཀུན་ ཏུ་ རྒྱུ་བ་ དེ་དག་ ལ་ ཚིག་ དེ་ ཐོས་ ནས །_ ལྷ་མ་ ཡིན་ དུ་ གཏོགས་པ་ ལ་ ཤིན་ཏུ་ ཁྲོ་ ཡང་ ཁྲོ་ལ་ རབ་ཏུ་ དགའ་བ་ རྣམས་ ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ལ་ དེ་དག་ ཐམས་ཅད་ སྔ་མ་ བཞིན་ དུ་ བསྙད་ དོ །_།
en: $113 “When the yakṣas of great miraculous powers hear these words of the wandering gods, their fury at the asuras will intensify and they will feel exulted. In the same way as before, they will then send the message to Takṣaka, Vāsuki, and all other such righteous nāga kings who follow the Dharma.

source: ལུས་ ཐམས་ཅད་ རབ་ཏུ་ འབར་བ་ དག་ གལ་ཏེ་ ཉིན་པ ར་ འོང་ ན་ དེ འི་ ཚེ་ ཉི་མ འི་ འོད་ཟེར་ རྣམས་ ཟིལ་ གྱིས་ མནན་ ནས་ མི་ མངོན་ ནོ །_།
en: If these beings, who have blazing bodies, approach during the day, the rays of the sun will outshine them and render them invisible.

source: དེ་ནས་ ལུས་ ཐམས་ཅད་ རབ་ཏུ་ འབར་བ་ དག་ ཀླུ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ རྣམས་ ལ་ སྦྲན་པ འི་ ཕྱིར་ མཚན་མོ་ རྒྱ་མཚོ འི་ ནང་ དུ་ འོང་ ན་
en: On the other hand, if these beings set out during the night to inform the righteous nāgas who follow the Dharma, they will be visible to everyone as they enter the ocean.

source: དེ་དག་ ཐམས་ཅད་ སྐྱེ་བོ་ ཀུན་ གྱིས་ མཐོང་བ ར་ འགྱུར་ ལ །_
en: $114 “At this point, sophists will think that they are witnessing a shooting star.

source: དེ་ མཐོང་ ནས་ རྟོག་གེ་པ་ རྣམས་ སྐར་མདའ་ ལྟུང་བ ར་ སེམས་ ཏེ །_
en: Therefore, since they think they have seen a shooting star, they will declare,

source: འདི་ལྟར་ སྐར་མདའ་ ལྟུང་བ ས་ ལོ་ལེགས་ པར་ [17b] འགྱུར་ རོ །_། ལོ་ཉེས་ པར་ འགྱུར་ རོ །_།
en: ‘Harvests will be good!’ [17.b] ‘Harvests will be bad!’

source: མི་ངས་ འབྱུང་བ ར་ འགྱུར་ རོ །_།
en: ‘There will be epidemics!’

source: མི་ངས་ འབྱུང་བ ར་ མི་ འགྱུར་ རོ །_།
en: ‘There will not be any epidemics!’

source: བ་ལང་ དང་ བྲམ་ཟེ་ དག་ འཕེལ་བ ར་ འགྱུར་ རོ །_།
en: ‘Cows and brahmins will flourish!’

source: བ་ལང་ དང་ བྲམ་ཟེ་ དག་ འགྲིབ་པ ར་ འགྱུར་ རོ་ ཞེས་ དེ་ལྟ ར་ ལས་ མངོན་པར་ མི་ ཤེས་པ་ དག་ འཐུན་ པར་ ཡོངས་སུ་ རྟོག་པ ར་ བྱེད་ དོ །_།
en: ‘Cows and brahmins will decline!’ In this fashion, they imagine things without having any direct knowledge.

source: དེ་ནས་ ཡང་ དགེ་སློང་ དེ་ སྐར་མདའ་ ལྟུང་བ་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_ དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ རྒྱུ་ གཞན་ གྱིས་ སྐར་མདའ་ ལྟུང་བ་ ཇི་ལྟ ར་ ལྟུང་བ་ མཐོང་ སྟེ །_
en: $115 “As the monk further examines shooting stars, he will employ knowledge derived from hearing and so perceive other causes for them.

source: ལྷ་ རྣམས་ ཀྱི་ གཞལ་མེད་ ཁང་ མགྱོགས་པ ར་ ནམ་མཁའ་ ལ་ འགྲོ་ ལ །_ གཞལ་མེད་ ཁང་ ཕན་ཚུན་ འགྲོ་བ་ གང་ཡིན་པ་ དེ་དག་ འདྲུད་པ་ ལས་ མེ་ འབྱུང་བ་ གང་ཡིན་པ་ དེ་དག་ ལ་ རྟོག་གེ་པ་ དག་ ན་རེ །_
en: He will notice how the chariots of the gods course swiftly across the sky and, as they traverse to and fro, flames emerge in the wake of their being pulled. When the scholars witness that, they will say,

source: འདི་ལྟར་ སྐར་མདའ་ རབ་ཏུ་ ལྟུང་བ་ ལས་ ལོ་ལེགས་ པར་ འགྱུར་ རོ །_།
en: ‘Look, a shooting star! Now the harvests will be good!’

source: བདེ་བ ར་ འགྱུར་ རོ །_།
en: ‘There will be war!’

source: མི་ བདེ་བ ར་ འགྱུར་ རོ །_།
en: ‘There will be peace!’

source: བ་ལང་ དང་ བྲམ་ཟེ་ འགྲིབ་པ ར་ འགྱུར་ རོ་ ཞེས་ དེ་ལྟ ར་ རྟོག་གེ་པ་ ལས་ ཀྱི་ འབྲས་བུ་ མངོན་པར་ མི་ ཤེས་པ་ དག་ འཇིག་རྟེན་པ འི་ མཚན་མ འི་ ལྟས་ སྟོན་པ ར་ བྱེད་ དོ །_།
en: ‘There will not be any epidemics!’ ‘Cows and brahmins will flourish!’ ‘Cows and brahmins will decline!’ This is how sophists, who have no knowledge of the effects of actions, will interpret mundane signs.

source: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན །_
en: Why do they do that?

source: དེ་ལྟ ར་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཕྲ་མོ་ སོ་སོ ར་ ཤེས་པ་ གང་ཡིན་པ་ ནི་ ལྷ་ དང་ བཅས་པ་ དང་ །_ བདུད་ དང་ བཅས་པ་ དང་ །_ ཚངས་པ་ དང་ བཅས་པ་ དང་ །_ དགེ་སྦྱོང་ དང་ བྲམ་ཟེ ར་ བཅས་པ འི་ སྐྱེ་དགུ་ དང་ །_ ལྷ་ དང་ །_ མི་ དང་ །_ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ ནང་ ན་ དེ་ མེད་ དེ
en: Because among all the gods, humans, and asuras—including gods, māras, brahmās, mendicants, and brahmins—there is no one who fully understands the subtle ripening of actions.

source: འདི་ལྟར་ བདག་ཅག་ གི་ ཆོས་ འདུལ་བ་ ལ་ སེམས་པ་ ནི་ དགེ་བ་ བཅུ འི་ ལས་ ཀྱི་ ལམ་ གཙོ་བོ ར་ བྱེད་པ་ ཡིན་ ནོ །_།
en: Therefore, it is the intention of our Dharma-Vinaya to emphasize the ten virtuous actions.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ སོ་སོ ར་ རྟོག་པ ར་ བྱེད་ དེ །_ ཀྱེ་མ་ བར་སྣང་ ལ་ རྒྱུ་བ འི་ གནོད་སྦྱིན་ མཐུ་བོ་ ཆེ་ རྣམས་ ཀུན་ ཏུ་ རྒྱུ་བ འི་ ལྷ་ རྣམས་ ཀྱི་ དྲུང་ དང་ །_ རྒྱ་མཚོ་ ན་ གནས་པ འི་ ཀླུ་ ཆོས་ དང་ ལྡན་པ་ རྣམས་ ཀྱི་ དྲུང་ དུ་ ཇི་ལྟ ར་ འགྲོ་ སྙམ་ ནས
en: $116 “Next, the monk who has knowledge of the effects of the ripening of karmic actions will ask himself, ‘How do the celestial yakṣas with great miraculous powers go before the wandering gods, and how do they visit the righteous nāgas that live in the ocean?’ [18.a]

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ [18a] ཤེས་པ ས་ བརྟགས་ ན །_ བར་སྣང་ ལ་ རྒྱུ་བ འི་ གནོད་སྦྱིན་ རབ་ཏུ་ འབར་བ་ རྣམས་ རྒྱ་མཚོ ར་ ཞུགས་ ཏེ །_ ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ ལྡན་པ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_
en: $117 “As he examines this matter with knowledge derived from hearing, he will notice how the blazing, celestial yakṣas enter the ocean and go before the righteous nāga kings, such as Takṣaka and Vāsuki.

source: འཇོག་པོ་ ལ་སོགས་པ་ ལ་ འདི་ལྟར་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དེ་དག་ མཚོ་ ཀུན་མཐོང་ དུ་ བདག་ཉིད་ ལ་ ལྟ་བ ར་ བྱེད་ དོ་
en: They bring them this message: ‘The necklace asuras and the asura king Firm are looking at the surface of Mirror Lake.’

source: ཞེས་ སྔ་མ་ བཞིན་ བར་སྣང་ ལ་ རྒྱུ་བ འི་ གནོད་སྦྱིན་ རྣམས་ ལ་ ཐོས་ ནས་ ཀླུ འི་ རྒྱལ་པོ་ ལོངས་སྤྱོད་ ལྡན་ ལ་ གནས་པ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_ འཇོག་པོ་ ལ་སོགས་ པས་ བར་སྣང་ ལ་ རྒྱུ་བ འི་ ཀླུ་ རྣམས་ ལ་
en: $118 “When Takṣaka, Vāsuki, and other such wealthy nāga kings hear this, they will instruct the nāgas that travel through the atmosphere,

source: འདི་ལྟར་ བདག་ གིས་ ཆོས་ དང་ མི་ ལྡན་པ འི་ ཀླུ་ དེ་དག་ མཐུ ས་ ཕྱིར་བཟློག་ ཅིང་ བསྐྲད་ དེ །_
en: ‘We shall stop the advance of the unrighteous nāgas.

source: ཆད་པ ས་ ཀྱང་ བཅད་ ནས །_
en: Let us drive them out and punish them.

source: འཛམ་བུ འི་ གླིང་ ན་ ཆོས་ དང་ ལྡན་པ་ རྣམས་ ཀྱི་ ལོ་ལེགས་ པར་ བྱ་བ་ དང་ །_ ཆར་ དབབ་པ་ དང་ །_ རླུང་ གིས་ གནོད་པ་ མེད་པར་ བྱ་བ་ དང་ །_
en: Let us ensure that the righteous humans in Jambudvīpa enjoy good harvests and timely rain, and that they are protected from harm.

source: འཛམ་བུ འི་ གླིང་ དུ་ འབྲས་ སཱ་ ལུ་ དང་ །_ ནས་ དང་ །_ བཟའ་བ་ དག་ འབྱུང་བ ར་ བྱ་བ་ དང་ །_
en: Let us make their rice, barley, and other foods abundant.

source: ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ མི་ རྣམས་ ཀྱི་ གྲོགས་ བྱ འོ་ ཞེས་ བསྙད་ དོ །_།
en: Let us help the righteous people who follow the Dharma.’

source: ཀླུ་ དེ་དག་ ལ་ དེ་སྐད་ བསྙད་ ནས་ ས་བླ འི་ གནོད་སྦྱིན་ རྣམས་ ཀླུ་ ཆོས་ དང་ མི་ ལྡན་པ་ དག་ ག་ལ་བ་ དེར་ གཡུལ་འགྱེད་པ འི་ ཕྱིར་ དོང་ སྟེ །_
en: $119 “When in this way they have informed the nāgas, the celestial yakṣas will next move on the unrighteous nāgas to do battle with them.

source: ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ བསྒྱིངས་པ་ ལ་སོགས་པ་ ལ །_
en: Thus, to nāga kings such as Pramatha and Aṭopa they will say,

source: འདི་ལྟར་ ཁྱེད་ ནི་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ ཡིན་ ལ །_ ངེད་ ནི་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ ཡིན་ ཏེ དེ་ལྟ ར་ ཁྱེད་ཅག་ དང་ ངེད་ ཅག་ མི་ འཐུན་ པར་ གྱུར་ ཅིང་ འགྲན་ཟླ ར་ གྱུར་པ ས་ ངེད་ ཅག་ ནི་ ཁྱེད་ཅག་ ལ་ བརྡེག་པ འི་ ཕྱིར་ འདིར་ འོངས་ སོ་ ཞེས་ སྨྲས་ སོ །_།
en: ‘You are unrighteous and do not follow the Dharma. We are righteous and follow the Dharma. Hence, we are opposed and rivals. We have come here to defeat you.’

source: དེ་ ཐོས་ ནས་ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ དང་ །_ བསྒྱིངས་པ་ ལ་སོགས་པ་ དེ་དག་ གཡུལ་འགྱེད་ དུ་ ལྷགས་ ཏེ་ དེ་དག་ ཕན་ཚུན་ གློག་ གི་ ཆར་ མང་པོ་ བྱུང་བ་ ན །_
en: $120 “Hearing this message, the nāga kings Pramatha, Aṭopa, and so on will come forth to meet them in battle, and, as they fight, the two parties will send thunderstorms against each other.

source: དེ་ གང་ གི་ ཚེ་ མར་ འཛིན་པ་ དང་ །_ ཕ ར་ འཛིན་པ་ དང་ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ འི་ སྐྱེ་དགུ་ འབྱུང་བ་ དེ འི་ ཚེ །_ ཀླུ འི་ རྒྱལ་པོ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_ འཇོག་པོ་ ལ་སོགས་པ་ རྒྱལ་བ ར་ འགྱུར་ ལ །_ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་སོགས་པ་ ཕམ་པ ར་ འགྱུར་ ཏེ
en: If at that time the people in Jambudvīpa respect their mothers, their fathers, mendicants, and brahmins, nāga kings such as Takṣaka and Vāsuki will prevail and Pramatha, Aṭopa, and so on will lose.

source: དེ་ལྟ ར་ འཛམ་བུ འི་ གླིང་ དུ་ ཆར་ ལེགས་པ ར་ འབབ་པ ར་ འགྱུར་ [18b] ཞིང་ དེས་ན་ ལོ་ལེགས་ པར་ འགྱུར་ རོ །_།
en: This will be followed by excellent rainfalls and harvests in Jambudvīpa. [18.b]

source: དེ འི་ ཚེ་ རྟོག་གེ་པ་ དག་ ན་རེ་ འདི་ ནི་ རྒྱུ་སྐར་ གྱི་ ཡོན་ཏན་ ཡིན་ ནོ །_། འདི་ ནི་ གཟ འི་ ཡོན་ཏན་ ཡིན་ ནོ །_།
en: $121 “At that time, sophists will say, ‘When rain falls abundantly and in a timely fashion, that is the benefit of celestial bodies, planets, and auspicious omens.

source: འདི་ ནི་ ལྟས་ ཀྱི་ ཡོན་ཏན་ ཡིན་ ནོ་ ཞེས་ བརྗོད་ དེ་ ཆར་ ལེགས་པ ར་ འབབ་པ་ གང་ དུས་ དུས་ སུ་ འབབ་པ ས་ ཆར་དུས་ དང་ འཐུན་ པར་ རབ་ཏུ་ འབབ་ སྟེ །_
en: The bounty of cows and brahmins is also the effect of that and of nothing else.’

source: བ་ལང་ དང་ བྲམ་ཟེ་ དག་ ཀྱང་ དེ འི་ འབྲས་བུ་ ཡིན་ གྱི་ གཞན་ གྱི་ ནི་ མ་ ཡིན་ ནོ་ ཞེའོ །_། གང་ གི་ ཚེ་ མར་ མི་ འཛིན་པ་ དང་ །_ ཕ ར་ མི་ འཛིན་པ་ དང་ །_ དགེ་སྦྱོང་ དུ་ མི་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ མི་ འཛིན་པ་ དང་ །_ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ འི་ སྐྱེ་དགུ་ དག་ འབྱུང་བ་ དེ འི་ ཚེ །_ ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ ལྡན་པ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ཕམ་པ ར་ འགྱུར་ ལ །_ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ བསྒྱིངས་པ་ ལ་སོགས་པ་ རྒྱལ་བ ར་ འགྱུར་ ཏེ
en: $122 “If at that time, however, the people of Jambudvīpa do not respect their mothers, fathers, mendicants, or brahmins, and if they are unrighteous and do not follow the Dharma, nāga kings such as Pramatha and Aṭopa will prevail.

source: ལོ་ཉེས་ འབྱུང་བ ར་ བྱེད །_ ཆར་ འབབ་ མི་ མཁས་པ ར་ བྱེད །_ ཆར་དྲག་ རྣམས་ ཀྱིས་ ལོ་ཏོག་ མ་ རུང་བ ར་ བྱེད །_ ཐན་པ་ འབྱུང་བ ར་ བྱེད་པ་ དང་ །_
en: They will then cause failed harvests, inopportune rain, torrential rains that destroy the crops, or droughts.

source: བྲམ་ཟེ་ རྟོག་གེ་པ་ དག་ གཞན་ དུ་ སྒྱུར་བ ར་ བྱེད་ དེ །_ འདི་ལྟར་ འདི་ ནི་ རྒྱུ་སྐར་ གྱི་ ཉེས་པ་ ཡིན་ ནོ །_། འདི་ ནི་ གཟ འི་ ཉེས་པ་ ཡིན་ ནོ །_། འདི་ ནི་ དུས་ ཀྱི་ ཉེས་པ་ ཡིན་ ནོ །_། འདི་ ནི་ ལྟས་ ཀྱི་ ཉེས་པ་ ཡིན་ ནོ་
en: Brahmin scholars, however, will construe this wrongly and claim, ‘This is due to harm caused by celestial bodies, planets, time, and inauspicious omens.’

source: ཞེས་ དེ་ལྟ ར་ རྟོག་གེ་པ་ ལས་ ཀྱི་ འབྲས་བུ་ མངོན་པར་ མི་ ཤེས་པ་ དག་ འདི་ལྟར་ གཞན་ དུ་ སྒྱུར་ ཡང་ དེ་ ཁོ་ན་ ནི་ མི་ མཐོང་ ངོ་ །_།
en: $123 “So say these sophists who have no knowledge of the effects of karmic action, and thus they construe things wrongly and fail to see reality.

source: དེ་ ནི་ ང འི་ ཉན་ཐོས་ སམ །_ ང འི་ ཆོས་ འདུལ་བ་ འདི་ ཐོས་ ནས་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ སོ་སོ ར་ ཤེས་པ་ གཙོ་བོ ར་ བྱེད་པ འམ །_
en: Because this can only be realized by my hearers, or those who hear my Dharma-Vinaya and subsequently apply themselves to understanding karmic ripening, or to understanding effects.

source: འབྲས་བུ་ སོ་སོ ར་ ཤེས་པ་ མ་གཏོགས་ པར་ ལྷ་ དང་ བཅས་པ འི་ འཇིག་རྟེན་ དང་ །_ ཚངས་པ་ དང་ བཅས་པ་ དང་ །_ དགེ་སྦྱོང་ དང་ བྲམ་ཟེ ར་ བཅས་པ འི་ སྐྱེ་དགུ་ དང་ །_ ལྷ་ དང་ མི་ དང་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ ཡུལ་ གྱི་ འཇུག་པ་ མ་ ཡིན་ ཏེ གཞན་མ་ ཡིན་པ ར་ མཐོང་ ངོ་ །_།
en: Apart from these people, such things remain beyond the domain of any gods, asuras, or humans—the entire godly realm including Brahmā, the entire human realm including mendicants and brahmins, or anyone else.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ ལྷ་མ་ ཡིན་ གྱི་ ས་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_ གང་ གི་ ཚེ་གང་ དུ་ ཀླུ་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ རྣམས་ ཀླུ་ ཆོས་ དང་ ལྡན་པ་ རྣམས་ ཀྱིས་ ཕམ་པ ར་ བྱས་པ་ དེ འི་ ཚེ །_
en: $124 “As the monk who has knowledge of the ripening of karmic effects continues to examine the realm of the asuras, he will notice what happens when the unrighteous nāgas that do not follow the Dharma are defeated by the righteous nāgas that follow the Dharma.
